//
//  DemoExcerpts.swift
//  excerpt
//
//  Created by Richard on 2023/9/17.
//

import Foundation

let demoExcerpts = [
    Excerpt(.general, title: "西方哲学史", author: "伯特兰·罗素", content: "科学告诉我们的是我们所能够知道的事物，但我们所能够知道的是很少的；而我们如果竟忘记了我们所不能知道的是何等之多，那末我们就会对许多极重要的事物变成麻木不仁了。另一方面，神学带来了一种武断的信念，说我们对于事实上我们是无知的事物具有知识，这样一来就对于宇宙产生了一种狂妄的傲慢。"),
    Excerpt(.general, title: "西方哲学史", author: "罗素", content: "柏拉图笔下的苏格拉底成了后来世世代代哲学家的典型。在伦理上我们对他应当怎样看法呢？（我只谈柏拉图所描绘的苏格拉底那个人。）他的优点是显著的。他对世俗的成败不介于怀，他是那样地大勇不惧，以致于直到最后的时刻他始终保持着安详、儒雅与幽默，并且对自己所信仰的真理比对任何其他的事物都更为关怀。然而，他也有一些非常严重的缺点。他的论证是不诚恳的，是诡辩的；在他暗地的思想里，他是在运用理智来证明他所喜欢的那些结论，而不是把理智运用于对于知识的无私追求。他也有一些沾沾自喜和油腔滑调的东西，使人联想到一个属于坏的类型的那种传教士。如果临死时他不曾相信他是要与众神在一片享受永恒的福祉，那末他的勇敢就会更加是了不起的了。苏格拉底不象他的某些前人那样，他在思维上是不科学的，而是一心一意要证明宇宙是投合他的伦理标准的。这是对于真理的背叛，而且是最恶劣的哲学罪恶。作为一个人来说，我们可以相信他有资格上通于圣者；但是作为一个哲学家来说，他可就需要长时期住在科学的炼狱里面了。"),
    Excerpt(.general, title: "西方哲学史", author: "罗素", content: """
        在柏拉图，哲学乃是一种洞见，乃是“对真理的洞见”。它不纯粹是理智的；它不仅仅是智慧而且是爱智慧。斯宾诺莎的“对上帝的理智的爱”大体也同样是思想与感情的这种密切结合。凡是做过任何一种创造性的工作的人，在或多或少的程度上，都经验过一种心灵状态；这时经过了长期的劳动之后，真理或者美就显现在，或者仿佛是显现在一阵突如起来的光荣里，——它可以仅是关乎某种细小的事情，也可能是关乎全宇宙。在这一刹那间，经验是非常有说服力的；事后可能又有怀疑，但在当时却是完全确凿可信的。我以为在艺术上、在科学上、在文学上以及在哲学上，大多数最美好的创造性的工作都是这样子的一刹那的结果。它对别人是不是来得也象对我个人那样，我不能肯定。就我而论，我发现当我想对某个题目写一本书的时候，我必须先使自己浸沉于细节之中，直到题材的各部分完全都熟悉了为止；然后有一天，如果我有幸的话，我便会看到各个部分都恰当地相互联系成一个整体。这时以后，我只须写下来我看见的东西就行了。最近似的类比就是先在雾里走遍了一座山，直到每一条道路、山岭和山谷一一地都已经非常熟悉了，然后再在光天化日之下，从远处来清晰地整个地观看这座山。
        这种经验我相信对于优秀的创造性的工作乃是必要的，但仅仅有它却是不够的；它所带来的那种主观上的确实可靠性，确乎也可以致命地把人引入歧途。威廉。詹姆士描写过一个人从笑气里面所得的经验；这个人只要一受笑气的作用，就知道了全宇宙的秘密，但是当他醒过来的时候，就又把它忘记了。最后他以极大的努力，乘看这种景象还未消失，就把秘密写了下来。等到完全清醒过来以后，他赶忙去看他写的是什么。他写下的是：“整个都是一股石油的气味”。看来好象是一种突如起来的洞见的东西，很可能是把人引入歧途的，所以当这场神圣的沉醉过去之后，就必须加以严格的检查。
    """),
    Excerpt(.general, title: "The Ten Commandments", author: "Bertrand Russell", content: "Do not feel envious of the happiness of those who live in a fool's paradise, for only a fool will think that it is happiness."),
    Excerpt(.verses, title: "离骚", author: "屈原", content: """
        路漫漫其修远兮，
        吾将上下而求索。
    """),
    Excerpt(.verses, title: "回答", author: "北岛", content: """
        卑鄙是卑鄙者的通行证，
        高尚是高尚者的墓志铭。
        看吧，在那镀金的天空中，
        飘满了死者弯曲的倒影。
        冰川纪过去了，
        为什么到处都是冰凌？
        好望角发现了，
        为什么死海里千帆相竞？
        我来到这个世界上，
        只带着纸、绳索和身影，
        为了在审判之前，
        宣读那些被判决了的声音：
        告诉你吧，世界，
        我——不——相——信！
        纵使你脚下有一千名挑战者，
        那就把我算做第一千零一名。
        我不相信天是蓝的，
        我不相信雷的回声；
        我不相信梦是假的，
        我不相信死无报应。
        如果海洋注定要决堤，
        就让所有的苦水都注入我心中；
        如果陆地注定要上升，
        就让人类重新选择生存的峰顶。
        新的转机和闪闪的星斗，
        正在缀满没有遮拦的天空，
        那是五千年的象形文字，
        那是未来人们凝视的眼睛。
    """),
    Excerpt(.lyrics, title: "很难", author: "张震岳", content: """
        有时候 想把自己关起来
        还是学着把心门打开
        人与人之间的关系
        变得不理不睬
        习惯 无关紧要的冷淡
    """),
    Excerpt(.general, title: "", author: "", content: "一句没有标题和作者的摘录。"),
    Excerpt(.general, title: "", author: "佚名", content: "一句没有标题的摘录。"),
    Excerpt(.general, title: "未命名", author: "", content: "一句没有作者的摘录。"),
]
